//给你一个整数数组 nums ，找到其中最长严格递增子序列的长度。 
//
// 子序列是由数组派生而来的序列，删除（或不删除）数组中的元素而不改变其余元素的顺序。例如，[3,6,2,7] 是数组 [0,3,1,6,2,2,7] 的子序
//列。 
// 
//
// 示例 1： 
//
// 
//输入：nums = [10,9,2,5,3,7,101,18]
//输出：4
//解释：最长递增子序列是 [2,3,7,101]，因此长度为 4 。
// 
//
// 示例 2： 
//
// 
//输入：nums = [0,1,0,3,2,3]
//输出：4
// 
//
// 示例 3： 
//
// 
//输入：nums = [7,7,7,7,7,7,7]
//输出：1
// 
//
// 
//
// 提示： 
//
// 
// 1 <= nums.length <= 2500 
// -104 <= nums[i] <= 104 
// 
//
// 
//
// 进阶： 
//
// 
// 你可以设计时间复杂度为 O(n2) 的解决方案吗？ 
// 你能将算法的时间复杂度降低到 O(n log(n)) 吗? 
// 
// Related Topics 二分查找 动态规划 
// 👍 1479 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    //贪心 + 二分
    // tail[end] 表示 长度为 end+1 的递增子序列的最后一个元素
    //每次遍历，大于tail[end]直接加入tail，
    // 否则往tail左找到右，第一个大于等于num[i]的元素，替换它。
    // 为什么等于的也要换，因为tail中要严格递增，即没用相同元素
    public int lengthOfLIS(int[] nums) {
        int[] tail = new int[nums.length];
        tail[0] = nums[0];//第一个元素作为初始子序列
        int end = 0;//tail尾下标
        for (int i = 0; i < nums.length; i++) {
            if (nums[i] > tail[end]) {
                tail[++end] = nums[i];
            }else {
                int l = 0, r = end;
                while (l < r) {
                    int mid = l + (r - l >> 1);
                    if (nums[i] > tail[mid]) {
                        l = mid + 1;
                    }else {
                        r = mid;
                    }
                }
                tail[l] = nums[i];
            }
        }
        return end + 1;
    }
}
//leetcode submit region end(Prohibit modification and deletion)
